class Strings:
    """Класс со строковыми представлениями отправляемых чат-ботом сообщений"""

    Start = "начать"
    StartEnglish = "start"
    FirstMessage = (
        "👋🏻 Привет! Меня зовут Вопрошалыч, вы можете задать мне вопрос об обучении в ТюмГУ "
        "или найти нужную информацию, нажав на кнопку «Справка» 😉\n\n"
        "Используется искусственный интеллект, поэтому ответы на произвольные вопросы могут содержать неточности. "
        "Продолжая работу с ботом, вы даёте согласие на обработку персональных данных и получение сообщений."
    )
    Subscribe = "Подписаться на рассылку"
    Unsubscribe = "Отписаться от рассылки"
    SubscribeMessage = "Теперь вы будете получать уведомления от чат-бота 🎉"
    UnsubscribeMessage = "Вам больше не будут приходить уведомления от чат-бота 😢"
    ConfluenceButton = "Справка"
    WhichInfoDoYouWant = "Какую информацию вы хотите получить?"
    TryFindAnswer = "Сейчас я попробую найти ответ на этот вопрос, это может занять какое-то время..."
    SourceURL = "Подробнее:"
    NotFound = "Извините, но я не могу найти ответ на этот вопрос. Попробуйте задать другой вопрос."
    NotAnswer = (
        "Извините, что-то пошло не так, однако я смог найти какую-то информацию в wiki."
    )
    ThanksForFeedback = "Спасибо за обратную связь! 🤗"
    SpamWarning = (
        "Я получил от вас больше 3 вопросов за минуту, мне нужно немного отдохнуть! 😰"
    )
    Less4Symbols = "В вопросе должно быть больше 3 символов 😉"
    NoneUserTelegram = "Для активации бота нужно отправить команду /start"
    NoneUserVK = "Для активации бота нужно написать сообщение «Начать» или «Start»"
