class Strings:
    Start = "начать"
    StartEnglish = "start"
    FirstMessage = f"👋🏻 Привет! Я виртуальный помощник ТюмГУ, ты можешь задать мне свой вопрос 😉\n\n" \
                        f"Продолжая работу, ты разрешаешь обработку своих персональных данных и получение сообщений. " \
                        f"Я также могу присылать тебе важные сообщения для всех студентов ТюмГУ, " \
                        f"однако ты можешь отписаться от рассылки, нажав на кнопку в меню ниже."
    Subscribe = "Подписаться на рассылку"
    Unsubscribe = "Отписаться от рассылки"
    SubscribeMessage = "Теперь ты будешь получать уведомления от чат-бота 🎉"
    UnsubscribeMessage = "Тебе больше не будут приходить уведомления от чат-бота 😢"
    TryFindAnswer = "Сейчас я попробую найти ответ на твой вопрос, это может занять какое-то время..."
    NotFound = "Извини, но я не могу найти ответ на этот вопрос. Может быть, тебя заинтересует что-то из этого:"
    NotFoundNotSimilar = "Извини, но я не могу найти ответ на этот вопрос. Попробуй задать другой вопрос."
    RateAnswer = "Пожалуйста, оцени последний ответ по 5-балльной шкале, нажав одну из кнопок:"
    ThanksForFeedback = "Спасибо за обратную связь! 🤗"
