import requests
from flask import render_template, request
from sqlalchemy import select
from sqlalchemy.orm import Session

from config import app
from models import db, QuestionAnswer


@app.route('/')
def index() -> str:
    """Функция позволяет отрендерить главную страницу веб-сервиса.

    Returns:
        str: отрендеренная главная веб-страница.
    """
    return render_template('main-page.html', page_title='Главная страница')


@app.route('/reindex', methods=['POST'])
def reindex_qa():
    """Функция отправляет POST-запрос на переиндексацию в модуле QA.

    Returns:
        str: Статус отправки запроса.
    """
    requests.post(f"http://{app.config['QA_HOST']}/reindex/")
    return render_template('settings.html', page_title='Настройки')


@app.route('/broadcast', methods=['POST', 'GET'])
def broadcast() -> str:
    """Функция позволяет отправить HTML-POST запрос на выполнение массовой рассылки на HOST чатбота.

    Returns:
        str: отрендеренная веб-страница с POST-запросом на сервер.
    """

    if request.method == 'POST':
        text = request.form.get('name')
        vk_bool = request.form.get('vk')
        tg_bool = request.form.get('telegram')
        response = requests.post(url=f"http://{app.config['CHATBOT_HOST']}/broadcast/",
                                 json={"text": text, "tg": tg_bool, "vk": vk_bool})
        if response.status_code == 200:
            return render_template('broadcast.html', response=response.text)
        else:
            response = 'Ваше сообщение не доставлено'
            return render_template('broadcast.html', response=response)
    else:
        return render_template('broadcast.html', page_title='Рассылка')


@app.route('/questions-wo-answers')
def questions() -> str:
    """Функция позволяет вывести на экране вопросы, не имеющие ответа.

    Returns:
        str: отрендеренная веб-страница с POST-запросом на базу данных.
    """

    clusters = [
    (
        (  # ПРЕДЛОЖЕНИЯ
        'Что делать если завалии на защите диплома? Когда пересдача?',
        'Меня завалили на защите диплома. Когда я могу перезащититься?',
        ',Меня завалили на защите когда пепесдача?',
        'Когда повторная защита диплома'
        ),
        (  # КЛЮЧЕВЫЕ СЛОВА
        'повторная защита диплома', 'защите диплома', 'могу перезащититься',
        'защите', 'делать', 'завалии', 'пересдача', 'завалили', 'пепесдача'
        ),
        1  # ТИПО ДАТА ВОПРОСА
    ),
    (
        (
        'Почему я не могу зайти в свой модеус?',
        'Что такое модеус',
        'что такое модеус?'
        ),
        (
        'могу зайти', 'свой модеус', 'модеус'
        ),
        2
    ),
    (
        (
        'как подключиться к университетскому wifi?',
        'Как в университете подключиться к бесплатному wifi?',
        'Как подключиться к wi-fi университета?'
        ),
        (
        'университетскому wifi', 'бесплатному wifi',
        'университете подключиться', 'подключиться'
        ),
        3
    ),
    (
        (
        'какие направления подготовки есть?',
        'Какие направления есть в ШКН?',
        'Могу ли я получить скидку за обучение по направлению 02.03.03?',
        'Какие направления обучения есть в Тюмгу?'
        ),
        (
        'какие направления подготовки', 'какие направления обучения',
        'какие направления', 'получить скидку', 'шкн', 'могу', 'обучение',
        'направлению 02', 'тюмгу'
        ),
        4
    ),
    (
        (
        'как получить справку о стипендии?',
        'как получить справку о размере стипендии?',
        'как получить справку о стипендии?',
        'как получить справку о размере стипендии?',
        'как получить справку о стипендии?',
        'как получить справку для битрикса?'
        ),
        (
        'справка', 'размер стипендии', 'стипендия'
        ),
        5
    ),
    (
        (
        'где находятся тьюторы?',
        'Кто такие тьюторы?',
        'Кто такие тьюторы?'
        ),
        (
        'находятся тьюторы', 'тьюторы'
        ),
        6
    ),
    (
        (
        'как закрыть физру',
        'Как модно закрыть физру, не ходя на неё?',
        'Как можно закрыть физру',
        'Как закрыть физру?'
        ),
        (
        'модно закрыть физру', 'закрыть физру', 'ходя'
        ),
        7
    ),
    (
        (
        'Я хожу в фитнес клуб. Как мне закрыть физру?',
        'Я хожу в фитнес-клуб. Как заменить физкультуру?',
        'Я хожу в фитнес-клуб. Как сдать физкультуру?',
        'Я хожу в фитнес-клуб. Как сдать физкультуру?',
        'Я хожу в фитнес клуб. Как мне закрыть физру?',
        'Я хожу в фитнес клуб. Как мне закрыть физру?',
        '1166 Я хожу в фитнес-клуб. Кому отдать договор, чтобы перезачли физру?',
        'Я хожу в фитнес-клуб. Кому отдать договор, чтобы перезачли физру?',
        'я хожу в частный фитнес-клуб, как перезачесть физру?'
        ),
        (
        'фитнес клуб', 'закрыть физру', 'заменить физкультуру',
        'сдать физкультуру', 'отдать договор', 'перезачли физру',
        'перезачесть физру', 'частный фитнес-клуб', 'фитнес-клуб', 'хожу'
        ),
        8
    ),
    (
        (
        'Где найти кафедру программного обеспечения?',
        'В каком кабинете кафедра?',
        'В каком кабинете кафедра программного обеспечения?',
        'Какие преподаватели есть на кафедре программного обеспечения?',
        'Средняя зарплата преподавателя на кафедре программного обеспечения?'
        ),
        (
        'каком кабинете кафедра', 'кафедре программного обеспечения',
        'средняя зарплата преподавателя', 'какие преподаватели'
        ),
        9
    ),
    (
        (
        'Можно ли пройти стажировку в какой-нибудь компании через университет?',
        'Есть ли в университете программы стажировки?', 'Стажировка'
        ),
        (
        'университете программы стажировки', 'пройти стажировку',
        'какой-нибудь компании', 'университет', 'стажировка'
        ),
        10
    ),
    (
        (
        'Где найти кабинет 415 в матфаке?', 'Где найти кабинет 415',
        'Где находится кабинет 404', 'Где находится 415 кабинет в ШКН?'
        ),
        (
        'найти кабинет 415', 'находится кабинет 404', 'находится 415 кабинет',
        'матфаке', 'шкн'
        ),
        11
    ),
    (
        (
        'Могу ли я получить скидку?', 'могу ли я претендовать на скидку?',
        'есть ли скидка на платном обучении?',
        'Можно ли получить скидку на платном обучении?',
        'Есть ли скидка на обучение?', 'Есть ли скидка на обучение?'
        ),
        (
        'платном обучении', 'получить скидку', 'скидку', 'могу', 'претендовать',
        'скидка', 'обучение'
        ),
        12
    )
    ]
    # data = select(QuestionAnswer.question).where(
    #     QuestionAnswer.answer == "").order_by(QuestionAnswer.id)
    # with Session(db.engine) as session:
    #     question_texts = [row[0] for row in session.execute(data)]
    return render_template('questions-wo-answers.html', clusters=clusters, page_title='Вопросы без ответов')


@app.route('/danger-questions')
def dangers() -> str:
    """Функция позволяет вывести на экране тревожные вопросы.

    Returns:
        str: отрендеренная веб-страница с POST-запросом на базу данных.
    """

    return render_template('danger-questions.html', page_title='Тревожные вопросы')


@app.route('/settings')
def settings() -> str:
    """Функция позволяет вывести на экране тревожные вопросы.

    Returns:
        str: отрендеренная веб-страница с POST-запросом на базу данных.
    """
    users = ["stud0000123158@study.utmn.ru", "stud0000275969@study.utmn.ru",
             "stud0000254037@study.utmn.ru", "stud0000258803@study.utmn.ru",
             "stud0000278346@study.utmn.ru", "stud0000281100@study.utmn.ru",
             "stud0000283207@study.utmn.ru"]

    return render_template('settings.html', users=users, page_title='Настройки')
